app/controllers/home_controller.rb

INSERT INTO "posts" ("title", "content", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "제목"], ["content", "내용"], ["date", "2018-04-03"], ["created_at", "2018-04-02 14:38:20.448063"], ["updated_at", "2018-04-02 14:38:20.448063"]]
---
  def create
    @post = Post.new #테이블의 한 빈 한 행을 추가
    @post.title = params[:post_title] #post_title이라는 이름의 내용을 title행에 저장
    @post.content = params[:post_content] #post_content라는 이름의 내용을 content 행에 저장
    @post.date = params[:post_date]
    @post.save #테이블에 써준 내용을 모두 저장 , .save 이후 id가 부여됨

SELECT "posts".* FROM "posts"
---
  def list
    @posts = Post.all #작성된 테이블 전체 보기

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 6]]
---
  def edit
    @post = Post.find(params[:post_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "posts" SET "title" = ?, "content" = ?, "date" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "d"], ["content", "afdas"], ["date", "2018-04-10"], ["updated_at", "2018-04-09 09:52:40.336962"], ["id", 6]]
---
  def update
    # 입력받을 데이터를 실제 DB에 저장할 액션. 실제 처리를 한다.
        @post = Post.find(params[:post_id])
        # 수정할 코드
        @post.title = params[:post_title]
        @post.content = params[:post_content]
        @post.date = params[:post_date]
        @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 7]]
---
  def delete
    @post = Post.find(params[:post_id])
    @post.destroy